In [4]:
import pandas as pd
#out=pd.read_html("https://www.w3schools.com/html/html_tables.asp")

In [5]:
#type(out)

In [6]:
#out[0]

In [7]:
pd.Series([10,20,30,40])

0    10
1    20
2    30
3    40
dtype: int64

In [14]:
s=pd.Series([10,20,30,40],index=["ram","mohan","safir","aman"],name="Age")

In [15]:
s["safir"]

30

In [36]:
names=pd.Series(["ram","mohan","safir","aman"],name="Name")

In [37]:
ages=pd.Series([10,20,30,40],name="Age")

In [38]:
pd.DataFrame([name,ages]).T

    Name Age
0    ram  10
1  mohan  20
2  safir  30
3   aman  40

In [40]:
d={
    "Name":names,
    "Age":ages
    
}
pd.DataFrame(d)

    Name  Age
0    ram   10
1  mohan   20
2  safir   30
3   aman   40

In [41]:
d1=[
    
    {"Name":"Safir",
     "Age":20
        
    },
      {"Name":"Aman",
     "Age":30
        
    },
      {"Name":"Mohan",
     "Age":25
        
    },
    
]
pd.DataFrame(d1)

   Age   Name
0   20  Safir
1   30   Aman
2   25  Mohan

In [43]:
import numpy as np
data=np.arange(25).reshape(5,5)

In [52]:
pd.DataFrame(data,index=list("abcde"),columns=list("vwxyz"))

    v   w   x   y   z
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19
e  20  21  22  23  24

In [53]:
df.tail(3)

    v   w   x   y   z
c  10  11  12  13  14
d  15  16  17  18  19
e  20  21  22  23  24

In [55]:
df.head(3)

    v   w   x   y   z
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, a to e
Data columns (total 5 columns):
v    5 non-null int32
w    5 non-null int32
x    5 non-null int32
y    5 non-null int32
z    5 non-null int32
dtypes: int32(5)
memory usage: 140.0+ bytes

In [57]:
df.describe()

               v          w          x          y          z
count   5.000000   5.000000   5.000000   5.000000   5.000000
mean   10.000000  11.000000  12.000000  13.000000  14.000000
std     7.905694   7.905694   7.905694   7.905694   7.905694
min     0.000000   1.000000   2.000000   3.000000   4.000000
25%     5.000000   6.000000   7.000000   8.000000   9.000000
50%    10.000000  11.000000  12.000000  13.000000  14.000000
75%    15.000000  16.000000  17.000000  18.000000  19.000000
max    20.000000  21.000000  22.000000  23.000000  24.000000

In [58]:
df["w"]

a     1
b     6
c    11
d    16
e    21
Name: w, dtype: int32

In [60]:
df[["x","y"]]

    x   y
a   2   3
b   7   8
c  12  13
d  17  18
e  22  23

In [64]:
df.loc[["a","b"],["x","y"]]  # items based

   x  y
a  2  3
b  7  8

In [65]:
df.loc['a':'d','x':'y'] # range based

    x   y
a   2   3
b   7   8
c  12  13
d  17  18

In [70]:
df["x"] < 10

a     True
b     True
c    False
d    False
e    False
Name: x, dtype: bool

In [76]:
df.loc[df['x']<10,df.loc['b']>2]

   v  w  x  y  z
a  0  1  2  3  4
b  5  6  7  8  9

In [87]:
# iloc about indexs
df.iloc[::-1,:3]

    v   w   x
e  20  21  22
d  15  16  17
c  10  11  12

In [90]:
df.drop(['e','d'],inplace=True)

In [96]:
data=np.random.randint(10,20,(5,5))

In [97]:
df=pd.DataFrame(data,index=list("Qwert"),columns=list("abcde"))

In [98]:
df

    a   b   c   d   e
Q  17  11  15  17  14
w  15  16  14  10  14
e  11  19  10  12  12
r  16  12  10  14  15
t  12  17  19  15  17

In [101]:
df.sort_index(axis=0)

    a   b   c   d   e
Q  17  11  15  17  14
e  11  19  10  12  12
r  16  12  10  14  15
t  12  17  19  15  17
w  15  16  14  10  14

In [102]:
df.sort_index(axis=1)

    a   b   c   d   e
Q  17  11  15  17  14
w  15  16  14  10  14
e  11  19  10  12  12
r  16  12  10  14  15
t  12  17  19  15  17

In [105]:
df.sort_values(['t'],axis=1)

    a   d   b   e   c
Q  17  17  11  14  15
w  15  10  16  14  14
e  11  12  19  12  10
r  16  14  12  15  10
t  12  15  17  17  19

In [106]:
df.sort_values(['b'],axis=0)

    a   b   c   d   e
Q  17  11  15  17  14
r  16  12  10  14  15
w  15  16  14  10  14
t  12  17  19  15  17
e  11  19  10  12  12

In [110]:
df.sort_values(['a','d'],axis=0)

    a   b   c   d   e
e  11  19  10  12  12
t  12  17  19  15  17
w  15  16  14  10  14
r  16  12  10  14  15
Q  17  11  15  17  14